InformationRegisters/ПривязкаПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Пользователи/Ext/Module.bsl
Функция ТекущийПользователь() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ОпределитьКадры() Экспорт
	_Пользователь = Пользователи.ТекущийПользователь();
	_Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПривязкаПользователя.Сотрудник КАК Сотрудник,
	|	ПривязкаПользователя.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.ПривязкаПользователя КАК ПривязкаПользователя
	|ГДЕ
	|	ПривязкаПользователя.УчетнаяЗапись = &Пользователь");
	
	_Запрос.УстановитьПараметр("Пользователь", _Пользователь);
	Выборка = _Запрос.Выполнить().Выгрузить()[0];
	Сотрудник = Выборка.Сотрудник;
	
	Возврат Сотрудник;
КонецФункции
